Revit 2024 API
FabricationAncillaryUsage Members
The FabricationAncillaryUsage type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FabricationAncillaryUsage
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AncillaryDepth
 Depth of required ancillary if it isn't round.
AncillaryId
 Fabrication ancillary database identifier.
AncillaryWidthOrDiameter
 Width or diameter of required ancillary.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Length
 Length of required ancillaries.
ProductCode
 A unique string code that idnenifies the ancillary in the fabriction database in order to purchase it.
Quantity
 Quantity of required ancillaries.
Type
 Fabrication ancillary type.
UsageType
 Fabrication ancillary usage type.
See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace